In [11]:
import pandas as pd

In [12]:
import zipfile
zipfile.ZipFile('names.zip').extractall('.')

In [13]:
all_years = []
for year in range(1880, 2017+1):
    all_years.append(pd.read_csv('yob{}.txt'.format(year),names = ['Name', 'Gender', 'Count']))
    all_years[-1]['Year'] = year
    df_res = pd.concat(all_years)

In [22]:
name_necessary_year = df_res[df_res['Year'].isin([1900,1950, 2000])]
all_name = name_necessary_year.groupby(['Name','Gender']).sum()
top_3 = all_name.groupby(['Name', 'Count']).max().sort_values('Count')[-3:]
top_3

               Year
Name   Count
Robert 101123  5850
John   109341  5850
James  111465  5850

In [28]:
name_gender = name_necessary_year.groupby(['Gender', 'Year']).agg(['sum','max'])
name_gender

                                                          Name            \
                                                           sum       max
Gender Year
F      1900  MaryHelenAnnaMargaretRuthElizabethFlorenceEthe...    Zylpha
       1950  LindaMaryPatriciaBarbaraSusanNancyDeborahSandr...     Zulma
       2000  EmilyHannahMadisonAshleySarahAlexisSamanthaJes...     Zyria
M      1900  JohnWilliamJamesGeorgeCharlesRobertJosephFrank...    Zollie
       1950  JamesRobertJohnMichaelDavidWilliamRichardThoma...   Zygmunt
       2000  JacobMichaelMatthewJoshuaChristopherNicholasAn...  Zyshonne

               Count
                 sum    max
Gender Year
F      1900   299800  16706
       1950  1713151  80432
       2000  1815110  25953
M      1900   150483   9829
       1950  1790549  86239
       2000  1962969  34471